; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v1 ?v3)
		(pred_6 ?v6)
		(pred_3 ?v8)
		(pred_5 ?v8)
		(pred_2 ?v6 ?v8)
		(pred_1)
		(pred_4 ?v6))

   (:action op_2
       :parameters  (?v4 ?v7)
       :precondition (and (not-eq ?v4 ?v7) 
                          (pred_3 ?v4) (pred_3 ?v7) (pred_5 ?v4))
       :effect (and  (pred_5 ?v7)
		     (not (pred_5 ?v4))))


   (:action op_1
       :parameters (?v5 ?v2)
       :precondition  (and  (pred_6 ?v5) (pred_3 ?v2)
			    (pred_2 ?v5 ?v2) (pred_5 ?v2) (pred_1))
       :effect (and (pred_4 ?v5)
		    (not (pred_2 ?v5 ?v2)) 
		    (not (pred_1))))

   (:action op_3
       :parameters  (?v5  ?v2)
       :precondition  (and  (pred_6 ?v5) (pred_3 ?v2)
			    (pred_4 ?v5) (pred_5 ?v2))
       :effect (and (pred_2 ?v5 ?v2)
		    (pred_1)
		    (not (pred_4 ?v5)))))

; problem
(define (problem ferry-l6-c2)
(:domain ferry)
(:objects obj_02 obj_03 obj_08 obj_01 obj_05 obj_07 
          obj_06 obj_04 
)
(:init
(pred_3 obj_02)
(pred_3 obj_03)
(pred_3 obj_08)
(pred_3 obj_01)
(pred_3 obj_05)
(pred_3 obj_07)
(pred_6 obj_06)
(pred_6 obj_04)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_08)
(not-eq obj_08 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_02)
(not-eq obj_03 obj_08)
(not-eq obj_08 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_07)
(not-eq obj_07 obj_03)
(not-eq obj_08 obj_01)
(not-eq obj_01 obj_08)
(not-eq obj_08 obj_05)
(not-eq obj_05 obj_08)
(not-eq obj_08 obj_07)
(not-eq obj_07 obj_08)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_05)
(pred_1)
(pred_2 obj_06 obj_05)
(pred_2 obj_04 obj_08)
(pred_5 obj_02)
)
(:goal
(and
(pred_2 obj_06 obj_07)
(pred_2 obj_04 obj_01)
)
)

(:constraints
  (and
    (sometime-before  (pred_2 obj_06 obj_07) (pred_5 obj_03))
    (sometime-before  (pred_2 obj_04 obj_01) (pred_5 obj_03))
  )
)
)

; plan
1. (op_2 obj_02 obj_08)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_08)
   goals met: 0 of 2
2. (op_1 obj_04 obj_08)
   deleted: (pred_2 obj_04 obj_08) (pred_1)
   added: (pred_4 obj_04)
   goals met: 0 of 2
3. (op_2 obj_08 obj_07)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_07)
   goals met: 0 of 2
4. (op_3 obj_04 obj_07)
   deleted: (pred_4 obj_04)
   added: (pred_2 obj_04 obj_07) (pred_1)
   goals met: 0 of 2
5. (op_2 obj_07 obj_05)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_05)
   goals met: 0 of 2
6. (op_1 obj_06 obj_05)
   deleted: (pred_2 obj_06 obj_05) (pred_1)
   added: (pred_4 obj_06)
   goals met: 0 of 2
7. (op_2 obj_05 obj_03)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_03)
   goals met: 0 of 2
8. (op_3 obj_06 obj_03)
   deleted: (pred_4 obj_06)
   added: (pred_2 obj_06 obj_03) (pred_1)
   goals met: 0 of 2
9. (op_2 obj_03 obj_07)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_07)
   goals met: 0 of 2
10. (op_1 obj_04 obj_07)
   deleted: (pred_2 obj_04 obj_07) (pred_1)
   added: (pred_4 obj_04)
   goals met: 0 of 2
11. (op_2 obj_07 obj_01)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_01)
   goals met: 0 of 2
12. (op_3 obj_04 obj_01)
   deleted: (pred_4 obj_04)
   added: (pred_2 obj_04 obj_01) (pred_1)
   goals met: 1 of 2
13. (op_2 obj_01 obj_03)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_03)
   goals met: 1 of 2
14. (op_1 obj_06 obj_03)
   deleted: (pred_2 obj_06 obj_03) (pred_1)
   added: (pred_4 obj_06)
   goals met: 1 of 2
15. (op_2 obj_03 obj_07)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_07)
   goals met: 1 of 2
16. (op_3 obj_06 obj_07)
   deleted: (pred_4 obj_06)
   added: (pred_2 obj_06 obj_07) (pred_1)
   goals met: 2 of 2
